justargldude/Smart-Bed-IoT/firmware_stm32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define FRONT_LEFT_OUTPUT_Pin GPIO_PIN_0
#define FRONT_LEFT_OUTPUT_GPIO_Port GPIOA
#define FRONT_LEFT_INPUT_Pin GPIO_PIN_1
#define FRONT_LEFT_INPUT_GPIO_Port GPIOA
#define FRONT_RIGHT_OUTPUT_Pin GPIO_PIN_2
#define FRONT_RIGHT_OUTPUT_GPIO_Port GPIOA
#define FRONT_RIGHT_INPUT_Pin GPIO_PIN_3
#define FRONT_RIGHT_INPUT_GPIO_Port GPIOA
#define BACK_RIGHT_OUTPUT_Pin GPIO_PIN_4
#define BACK_RIGHT_OUTPUT_GPIO_Port GPIOA
#define BACK_RIGHT_INPUT_Pin GPIO_PIN_5
#define BACK_RIGHT_INPUT_GPIO_Port GPIOA
#define BACK_LEFT_OUTPUT_Pin GPIO_PIN_6
#define BACK_LEFT_OUTPUT_GPIO_Port GPIOA
#define BACK_LEFT_INPUT_Pin GPIO_PIN_7
#define BACK_LEFT_INPUT_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
